Revit 2026 API

# FluidTemperatureSetIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual FluidTemperature Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As FluidTemperature
	Get
```
```cpp
public:
virtual property FluidTemperature^ Current {
	FluidTemperature^ get ();
}
```
```fsharp
abstract Current : FluidTemperature with get
override Current : FluidTemperature with get
```

#### Property Value

FluidTemperature

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

FluidTemperatureSetIterator Class

Autodesk.Revit.DB.Plumbing Namespace